# 2. Реализовать проект расчета суммарного расхода ткани на производство одежды. Основная сущность (класс) этого
# проекта — одежда, которая может иметь определенное название. К типам одежды в этом проекте относятся пальто и
# костюм. У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма). Это могут быть обычные
# числа: V и H, соответственно. Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто
# (V/6.5 + 0.5), для костюма (2 * H + 0.3). Проверить работу этих методов на реальных данных. Реализовать общий
# подсчет расхода ткани. Проверить на практике полученные на этом уроке знания: реализовать абстрактные классы для
# основных классов проекта, проверить на практике работу декоратора @property.


from abc import ABC, abstractmethod


class Clothing(ABC):

    @abstractmethod
    def cost(self):
        pass


class Coat(Clothing):

    def __init__(self, size):
        self.size = int(size)

    @property
    def cost(self):
        return self.size / 6.5 + 0.5


class Suit(Clothing):

    def __init__(self, height):
        self.height = int(height)

    @property
    def cost(self):
        return self.height * 2.0 + 0.3


my_suit = Suit(187)
my_coat = Coat(54)
print("Общий расход ткани =", my_coat.cost + my_suit.cost)
